davidday99/tm4c-web-server/src/main.c
#include "system.h"
#include "ssi.h"
#include "gpio.h"
#include "tm4c123gh6pm.h"
#include "st7735.h"
#include "enc28j60.h"
#include "lcd.h"
#include "socket.h"
#include "ipv4.h"

extern void EnableInterrupts();
extern void DisableInterrupts();
extern void StartCritical();
extern void EndCritical();

LCD lcd;
struct ENC28J60 *enc = &ENC28J60;

void Delay(uint32_t d) {
    uint32_t volatile delay = d * 80000;
    while (delay > 0)
        delay--;
}

static uint8_t frame[] = {
    0xB4,
    0x2E,
    0x99,
    0xEC,
    0x02,
    0xC5,
    0xA0,
    0xCD,
    0xEF,
    0x01,
    0x23,
    0x45,
    0x08,
    0x00,
    0x45,
    0x00, 
    0x00,
    0x21,
    0xFF,
    0xFF,
    0x40,
    0x00,
    0x40,
    0x11,
    0x00,
    0x00,
    0xC0,
    0xA8,
    0x00,
    0x6E,
    0xC0,
    0xA8,
    0x00,
    0x81,
    0x00,
    0x50,
    0x00,
    0x50,
    0x00,
    0x0D,
    0x00,
    0x00,
    'O',
    'K',
    'A',
    'Y',
    0
};

int main(void){

    DisableInterrupts();

    PLL_init();

    lcd_init(&lcd);
    
    if (ENC28J60_init(enc)) {
        lcd_write(&lcd, "ENC initialized.\n");
        ENC28J60_enable_receive(enc) ? lcd_write(&lcd, "Receive enabled.\n") : 
                                    lcd_write(&lcd, "Could not enable.\n");
    } else {
        lcd_write(&lcd, "Could not init.\n");
    }

    ipv4_set_address(0xC0A8006F);  // set IP address as 192.168.0.111

    struct socket *sock = socket_init(SOCKTYPE_TCP);
    struct socket_addr sockaddr = {SOCKADDR_IP_ANY, 8000};
    socket_bind(sock, 8000);
    uint8_t data[64];
    uint8_t reply[] = "Hello, world!\n";

    EnableInterrupts();

    int i = 0;
    int len;

    socket_accept(sock);
    lcd_write(&lcd, "conn. established\n");
    while (1) {
        len = socket_read(sock, data, 64);
        if (len == 0) {
            socket_accept(sock);
            continue;
        }
        if (len > 0) {
            data[len] = '\0';
            lcd_write(&lcd, (char *) data);
            lcd_write(&lcd, "\n");
            socket_send(sock, data, len);
            data[0] = '\0';
        }
    }
}